zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/rtc_reg.h
#define RTC_TAMPCAL_TENYEAR_Pos          (20)                                              /*!< RTC_T::TAMPCAL: TENYEAR Position       */
#define RTC_TAMPCAL_TENYEAR_Msk          (0xful << RTC_TAMPCAL_TENYEAR_Pos)                /*!< RTC_T::TAMPCAL: TENYEAR Mask           */

#define RTC_CLKDCTL_LXTFDEN_Pos          (0)                                               /*!< RTC_T::CLKDCTL: LXTFDEN Position       */
#define RTC_CLKDCTL_LXTFDEN_Msk          (0x1ul << RTC_CLKDCTL_LXTFDEN_Pos)                /*!< RTC_T::CLKDCTL: LXTFDEN Mask           */

#define RTC_CLKDCTL_LXTFSW_Pos           (1)                                               /*!< RTC_T::CLKDCTL: LXTFSW Position        */
#define RTC_CLKDCTL_LXTFSW_Msk           (0x1ul << RTC_CLKDCTL_LXTFSW_Pos)                 /*!< RTC_T::CLKDCTL: LXTFSW Mask            */

#define RTC_CLKDCTL_LXTSTSW_Pos          (2)                                               /*!< RTC_T::CLKDCTL: LXTSTSW Position       */
#define RTC_CLKDCTL_LXTSTSW_Msk          (0x1ul << RTC_CLKDCTL_LXTSTSW_Pos)                /*!< RTC_T::CLKDCTL: LXTSTSW Mask           */

#define RTC_CLKDCTL_SWLIRCF_Pos          (16)                                              /*!< RTC_T::CLKDCTL: SWLIRCF Position       */
#define RTC_CLKDCTL_SWLIRCF_Msk          (0x1ul << RTC_CLKDCTL_SWLIRCF_Pos)                /*!< RTC_T::CLKDCTL: SWLIRCF Mask           */

#define RTC_CLKDCTL_LXTSLOWF_Pos         (17)                                              /*!< RTC_T::CLKDCTL: LXTSLOWF Position      */
#define RTC_CLKDCTL_LXTSLOWF_Msk         (0x1ul << RTC_CLKDCTL_LXTSLOWF_Pos)               /*!< RTC_T::CLKDCTL: LXTSLOWF Mask          */

#define RTC_CDBR_STOPBD_Pos              (0)                                               /*!< RTC_T::CDBR: STOPBD Position           */
#define RTC_CDBR_STOPBD_Msk              (0xfful << RTC_CDBR_STOPBD_Pos)                   /*!< RTC_T::CDBR: STOPBD Mask               */

#define RTC_CDBR_FAILBD_Pos              (16)                                              /*!< RTC_T::CDBR: FAILBD Position           */
#define RTC_CDBR_FAILBD_Msk              (0xfful << RTC_CDBR_FAILBD_Pos)                   /*!< RTC_T::CDBR: FAILBD Mask               */

/** @} RTC_CONST */
/** @} end of RTC register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __RTC_REG_H__ */
